#### Create3DOrthographic Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create3DOrthographic(Document, ElementId) | Creates a new orthographic 3D assembly view for the assembly instance. |
| Public method Static member | Create3DOrthographic(Document, ElementId, ElementId, Boolean) | Creates a new orthographic 3D assembly view for the assembly instance. The view will have the same orientation as the Default 3D view. The document must be regenerated before using the 3D view. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace